
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьРегистрациюИзмененийПоставляемыхДанных();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОчиститьРегистрациюИзмененийПоставляемыхДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзмененияПоставляемыхДанных.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ИзмененияПоставляемыхДанных КАК ИзмененияПоставляемыхДанных
	|ГДЕ
	|	ИзмененияПоставляемыхДанных.Ссылка <> &ЭтотУзел";
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ИзмененияПоставляемыхДанных.ЭтотУзел());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры