
Перем Запрос;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПоставляемыеДанные.СформироватьВременнуюТаблицуДанныхНабораЗаписей(Запрос, ЭтотОбъект, "Период, Валюта"); 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПоставляемыеДанные.ЗарегистрироватьИзмененияДанныхНабораЗаписей(Запрос, ЭтотОбъект, "Валюта", "Период, Валюта", Истина); 
	
КонецПроцедуры
