
Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("ТекущееЗначение", Константы.ИспользоватьРазделениеПоОбластямДанных.Получить());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Константы.НеИспользоватьРазделениеПоОбластямДанных.Установить(НЕ Значение);
	
	Если ДополнительныеСвойства.ТекущееЗначение <> Значение Тогда
		ОбновитьПовторноИспользуемыеЗначения();
		Если Значение Тогда
			СтандартныеПодсистемыПереопределяемый.ПриВключенииРазделенияПоОбластямДанных();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
