////////////////////////////////////////////////////////////////////////////////
// ОбменСообщениямиПереопределяемый: механизм обмена сообщениями.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает список обработчиков сообщений, которые обрабатывает
// данная информационная система.
// 
// Параметры:
//  Обработчики - ТаблицаЗначений - состав полей см. в ОбменСообщениями.НоваяТаблицаОбработчиковСообщений
// 
Процедура ПолучитьОбработчикиКаналовСообщений(Обработчики) Экспорт
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса
	ОбработчикКаналовСообщенийОбменаДаннымиВРежимеСервиса.ПолучитьОбработчикиКаналовСообщений(Обработчики);
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса
	
	
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.УдаленноеАдминистрирование
	ОбработчикКаналовСообщенийУдаленногоАдминистрирования.ПолучитьОбработчикиКаналовСообщений(Обработчики);
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.УдаленноеАдминистрирование
	
КонецПроцедуры

// Обработчик получения динамического списка конечных точек сообщений
//
// Параметры:
//  КаналСообщений – Строка. Идентификатор канала сообщений, для которого необходимо определить конечные точки.
//  Получатели     – Массив. Массив конечных точек, в которые следует адресовать сообщение.
//                   Массив должен быть заполнен элементами типа ПланОбменаСсылка.ОбменСообщениями.
//                   Этот параметр необходимо определить в теле обработчика.
//
Процедура ПолучателиСообщения(Знач КаналСообщений, Получатели) Экспорт
	
	
	
КонецПроцедуры









