
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнтервалВремениВыполнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("АвтоматическоеИзвлечениеТекстов", "ИнтервалВремениВыполнения");
	Если ИнтервалВремениВыполнения = 0 Тогда
		ИнтервалВремениВыполнения = 60;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("АвтоматическоеИзвлечениеТекстов", "ИнтервалВремениВыполнения",  ИнтервалВремениВыполнения);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
#Если ВебКлиент Тогда
	Отказ = Истина;
	Предупреждение(НСтр("ru = 'В Веб-клиенте извлечение текстов не поддерживается.'"));
	Возврат;
#КонецЕсли

	// здесь ТекущаяДата() не пишется в базу - только на клиенте показывается в информационных целях - поэтому заменять на ТекущаяДатаСеанса не надо
	ПрогнозируемоеВремяНачалаИзвлечения = ТекущаяДата() + ИнтервалВремениВыполнения;
	ПодключитьОбработчикОжидания("ИзвлечениеТекстовКлиентОбработчик", ИнтервалВремениВыполнения);
	
	ПодключитьОбработчикОжидания("ОбновлениеОбратногоОтсчета", 1);
	ОбновлениеОбратногоОтсчета();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ИнтервалВремениВыполненияПриИзменении(Элемент)
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("АвтоматическоеИзвлечениеТекстов", "ИнтервалВремениВыполнения",  ИнтервалВремениВыполнения);
	ОтключитьОбработчикОжидания("ИзвлечениеТекстовКлиентОбработчик");
	
	// здесь ТекущаяДата() не пишется в базу - только на клиенте показывается в информационных целях - поэтому заменять на ТекущаяДатаСеанса не надо
	ПрогнозируемоеВремяНачалаИзвлечения = ТекущаяДата() + ИнтервалВремениВыполнения;
	
	ПодключитьОбработчикОжидания("ИзвлечениеТекстовКлиентОбработчик", ИнтервалВремениВыполнения);
	ОбновлениеОбратногоОтсчета();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗапуститьСейчас(Команда)
#Если НЕ ВебКлиент Тогда
	ИзвлечениеТекстовКлиентОбработчик();
#КонецЕсли
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Процедура ЗаписьЖурналаРегистрацииСервер(ТекстСообщения)
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Извлечение текста файла'"), УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсеИспользуемыеОбластиДанных()
	
	МассивОбластейДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбластиДанных.ОбластьДанных КАК ОбластьДанных
	               |ИЗ
	               |	РегистрСведений.ОбластиДанных КАК ОбластиДанных
	               |ГДЕ
	               |	ОбластиДанных.Статус = &Статус";
				   
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыОбластейДанных.Используется);
	
	Для Каждого Строка Из Запрос.Выполнить().Выгрузить() Цикл
		МассивОбластейДанных.Добавить(Строка.ОбластьДанных);
	КонецЦикла;
	
	Возврат МассивОбластейДанных;
	
КонецФункции

// Обновляет обратный отсчет
//
&НаКлиенте
Процедура ОбновлениеОбратногоОтсчета()
	
	// здесь ТекущаяДата() не пишется в базу - только на клиенте показывается в информационных целях - поэтому заменять на ТекущаяДатаСеанса не надо
	Осталось = ПрогнозируемоеВремяНачалаИзвлечения - ТекущаяДата();
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'До начала извлечения текстов осталось %1 сек'"), 
							Осталось);
	
	Если Осталось <= 1 Тогда
		ТекстСообщения = "";
	КонецЕсли;
	
	ИнтервалВремениВыполнения = Элементы.ИнтервалВремениВыполнения.ТекстРедактирования;
	Статус = ТекстСообщения;
	
КонецПроцедуры

#Если НЕ ВебКлиент Тогда
	
// Извлекает текст из файлов на диске на клиенте.
//
&НаКлиенте
Процедура ИзвлечениеТекстовКлиентОбработчик()
	ИзвлечениеТекстовКлиент();
КонецПроцедуры

// Извлекает текст из файлов на диске на клиенте.
//
&НаКлиенте
Процедура ИзвлечениеТекстовКлиент()
	
	МассивОбластейДанных = ПолучитьВсеИспользуемыеОбластиДанных();
	
	Попытка
	
		ПолноеКоличествоФайловСНеизвлеченнымТекстом = 0;
		ЧислоНеизвлеченныхДляОбластей = Новый Соответствие;
		
		// сперва подсчитаем количество файлов с неизвлеченным текстом во всех областях
		Для Каждого Область Из МассивОбластейДанных Цикл
			
			ОбщегоНазначения.УстановитьРазделениеСеанса(Истина, Область);
			КоличествоФайловСНеизвлеченнымТекстом = 0;
			ФайловыеФункцииПереопределяемый.ПолучитьКоличествоВерсийСНеизвлеченнымТекстом(КоличествоФайловСНеизвлеченнымТекстом);
			ПолноеКоличествоФайловСНеизвлеченнымТекстом = ПолноеКоличествоФайловСНеизвлеченнымТекстом + КоличествоФайловСНеизвлеченнымТекстом;
			ЧислоНеизвлеченныхДляОбластей.Вставить(Область, КоличествоФайловСНеизвлеченнымТекстом);
			ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
		
		КонецЦикла;
		
		КоличествоВПорции = 100;
		
		
		// для каждой области вызовем извлечение
		КоличествоОбластей = МассивОбластейДанных.Количество();
		Для Каждого Область Из МассивОбластейДанных Цикл
			
			ЧислоНеизвлеченных = ЧислоНеизвлеченныхДляОбластей.Получить(Область);
			Если ЧислоНеизвлеченных <> Неопределено И ЧислоНеизвлеченных <> 0 Тогда
				
				РазмерПорцииДляОбласти = Окр((ЧислоНеизвлеченных / ПолноеКоличествоФайловСНеизвлеченнымТекстом)	* КоличествоВПорции);
				Если РазмерПорцииДляОбласти = 0 Тогда
					РазмерПорцииДляОбласти = 1;
				КонецЕсли;	
			
				ОбщегоНазначения.УстановитьРазделениеСеанса(Истина, Область);
				ИзвлечениеТекстовОднойОбластиДанных(РазмерПорцииДляОбласти);
				ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
			КонецЕсли;
		
		КонецЦикла;
		
		// возвращаемся в неразделенный режим
		ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
	
	Исключение
	
		// возвращаемся в неразделенный режим
		ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
		ВызватьИсключение;
	
	КонецПопытки;
	
КонецПроцедуры

// Извлекает текст из файлов на диске на клиенте.
//
// Параметры:
// РазмерПорции - Число - Количество файлов в порции.
//
&НаКлиенте
Процедура ИзвлечениеТекстовОднойОбластиДанных(РазмерПорции = Неопределено)
	
	// здесь ТекущаяДата() не пишется в базу - только на клиенте показывается в информационных целях - поэтому заменять на ТекущаяДатаСеанса не надо
	ПрогнозируемоеВремяНачалаИзвлечения = ТекущаяДата() + ИнтервалВремениВыполнения;
	
	Состояние(НСтр("ru = 'Начато извлечение текста'"));
	
	Попытка
		
		РазмерПорцииТекущий = 100;
		Если РазмерПорции <> Неопределено Тогда
			РазмерПорцииТекущий = РазмерПорции;
		КонецЕсли;	
		
		МассивФайлов = ПолучитьФайлыДляИзвлеченияТекста(РазмерПорцииТекущий);
		
		Если МассивФайлов.Количество() = 0 Тогда
			Состояние(НСтр("ru = 'Нет файлов для извлечения текста'"));
			Возврат;
		КонецЕсли;
		
		Для Индекс = 0 По МассивФайлов.Количество() - 1 Цикл
			
			Расширение = МассивФайлов[Индекс].Расширение;
			ФайлИлиВерсияФайла = МассивФайлов[Индекс].Ссылка;
			
			АдресФайла = ФайловыеФункцииПереопределяемый.ПолучитьНавигационнуюСсылкуФайла(ФайлИлиВерсияФайла, УникальныйИдентификатор);
			
			Прогресс = Индекс * 100 / МассивФайлов.Количество();
			Состояние(НСтр("ru = 'Идет извлечение текста файла'"), Прогресс, Строка(ФайлИлиВерсияФайла));
			
			ФайловыеФункцииКлиент.ИзвлечьТекстВерсии(ФайлИлиВерсияФайла, АдресФайла, Расширение, УникальныйИдентификатор);
		КонецЦикла;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								 НСтр("ru = 'Извлечение текста завершено. Обработано файлов: %1'"), 
								 МассивФайлов.Количество());
		Состояние(ТекстСообщения);
		
	Исключение
		
		ОписаниеОшибкиИнфо = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Во время извлечения текста из файла ""%1"" произошла неизвестная ошибка.'"), 
								Строка(ФайлИлиВерсияФайла));
								
		ТекстСообщения = ТекстСообщения + Строка(ОписаниеОшибкиИнфо);
		
		Состояние(ТекстСообщения);
		
		// запись в журнал регистрации
		ЗаписьЖурналаРегистрацииСервер(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецЕсли

&НаСервереБезКонтекста
Функция ПолучитьФайлыДляИзвлеченияТекста(КоличествоФайловВПорции)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	ПолучитьВсеФайлы = (КоличествоФайловВПорции = 0);
	ФайловыеФункцииПереопределяемый.ПолучитьТекстЗапросаДляИзвлеченияТекста(Запрос.Текст, ПолучитьВсеФайлы);
	
	Для Каждого Строка Из Запрос.Выполнить().Выгрузить() Цикл
		
		Результат.Добавить(Новый Структура("Ссылка, Расширение", Строка.Ссылка, Строка.Расширение));
		
		// если превысили нужное количество результатов, выходим
		Если КоличествоФайловВПорции <> 0 И Результат.Количество() >= КоличествоФайловВПорции Тогда
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
