
&НаКлиенте
Процедура ОбновитьДанныеСправочника(Команда)
	
	ЕстьИзменения = Ложь;
	ЕстьУдаленные = Ложь;
	
	ОбновитьДанныеСправочникаНаСервере(ЕстьИзменения, ЕстьУдаленные);
	
	Если ЕстьИзменения Тогда
		Текст = НСтр("ru = 'Обновление выполнено успешно.'");
	Иначе
		Текст = НСтр("ru = 'Обновление не требуется.'");
	КонецЕсли;
	
	Если ЕстьУдаленные Тогда
		Текст = Текст
			+ Символы.ПС
			+ Символы.ПС
			+ НСтр("ru = 'Найдены удаленные объекты метаданных
			             |(см. элементы, начинающиеся с символа ""?"").'");
	КонецЕсли;
	
	Предупреждение(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСправочникаНаСервере(ЕстьИзменения, ЕстьУдаленные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(ЕстьИзменения, ЕстьУдаленные);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

