

// Обработчик события ПередЗаписью предотвращает изменение идентификаторов
// объектов метаданных для которых допустимо только предусмотренное
// обновление на основе метаданных конфигурации с помощью
// процедуры:
//
// Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника()
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ВыполняетсяАвтоматическоеОбновлениеДанныхСправочника") Тогда
		
		ВызватьИсключение(НСтр("ru = 'Ошибка при работе со справочником ""Идентификаторы объектов метаданных"".
		                             |
		                             |Изменение идентификаторов объектов метаданных выполняется
		                             |- либо автоматически с помощью процедуры
		                             |  Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(),
		                             |- либо вручную через конфигуратор (добавление/удаление предопределенных элементов).
		                             |
		                             |Допустимо удаление неиспользуемых элементов, помеченных на удаление.'"));
	КонецЕсли;
	
КонецПроцедуры


// Обработчик события ПередУдалением предотвращает удаление идентификаторов
// объектов метаданных, у которых значение реквизита "Используются" установлено Истина
// или значение реквизита "ПометкаУдаления" установлено Ложь.
//
Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Используется Тогда
		ВызватьИсключение(НСтр("ru = 'Ошибка при работе со справочником ""Идентификаторы объектов метаданных"".
		                             |
		                             |Удаление идентификаторов объектов метаданных, у которых значение
		                             |реквизита ""Используется"" установлено Истина недопустимо.'"));
	ИначеЕсли НЕ ПометкаУдаления Тогда
		ВызватьИсключение(НСтр("ru = 'Ошибка при работе со справочником ""Идентификаторы объектов метаданных"".
		                             |
		                             |Удаление идентификаторов объектов метаданных, у которых значение
		                             |реквизита ""ПометкаУдаления"" установлено Ложь недопустимо.'"));
	КонецЕсли;
	
КонецПроцедуры

