
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	АдресВХранилище = Неопределено;
	Если НЕ ПоместитьФайл(АдресВХранилище, "*.zip") Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеНаСервере(АдресВХранилище);
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(Знач АдресВХранилище)
	
	ДанныеАрхива = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
	ДанныеАрхива.Записать(ИмяАрхива);
	ДанныеАрхива = Неопределено;
	
	ВыгрузкаЗагрузкаДанных.ЗагрузитьТекущуюОбластьИзАрхива(ИмяАрхива);
	
	Попытка
		УдалитьФайлы(ИмяАрхива);
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры
