////////////////////////////////////////////////////////////////////////////////
// Подсистема "Рассылка отчетов" (клиент, переопределяемый)
// 
// Выполняется на клиенте, изменяется под специфику прикладной конфигурации, 
// но предназначен для использования только данной подсистемой.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Опциональные связи с другими подсистемами

// Если подсистема "Дополнительные отчеты и обработки" недоступна, то содержимое
//   процедуры необходимо удалить или закомментировать. 
//   Открывает форму подбора дополнительных отчетов.
// 
Процедура ПодборДопОтчетов(ЭлементФормы) Экспорт
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет");
	Отчет               = ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.Отчет");
	
	ОтборПоВиду = Новый СписокЗначений;
	ОтборПоВиду.Добавить(ДополнительныйОтчет, ДополнительныйОтчет);
	ОтборПоВиду.Добавить(Отчет, Отчет);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.Независимый);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормыВыбора.Вставить("Отбор",              Новый Структура("Вид", ОтборПоВиду));
	
	ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.ФормаВыбора", ПараметрыФормыВыбора, ЭлементФормы);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
КонецПроцедуры // ОткрытьПодборДопОтчетов

// Если подсистема "Работа с файлами" недоступна, то содержимое процедуры
//   необходимо удалить или закомментировать.
//   Открывает форму папки со списком файлов.
// 
Процедура ОткрытьФормуПапки(СтандартнаяОбработка, Папка) Экспорт
	
	// СтандартныеПодсистемы.РаботаСФайлами
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Папка", Папка);
	ОткрытьФорму("Справочник.Файлы.Форма.ХранилищеФайлов", ПараметрыФормы, , Папка);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры // ОткрытьФормуПапки 
