////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрефиксИнформационнойБазы = ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы");
	
	ПрефиксИнформационнойБазыУстановлен = Не ПустаяСтрока(ПрефиксИнформационнойБазы);
	
	Элементы.Страницы.ТекущаяСтраница = ?(ПрефиксИнформационнойБазыУстановлен,
						Элементы.СтраницаОтображенияПрефиксаИнформационнойБазы,
						Элементы.СтраницаОтображенияИнформацииОПустомПрефиксе);
	//
	
КонецПроцедуры
