///////////////////////////////////////////////////////////////////////////////////////////////////////////
// ВыгрузкаЗагрузкаДанныхПереопределяемый: обработка событий выгрузки и загрузки данных в области.
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Обработчик, вызываемый для данных перед их записью в файл при выгрузке областей.
//
// Параметры:
// ЭлементДанных - КонстантаМенеджер.<Имя>; СправочникОбъект.<Имя>; Регистр<Вид>НаборЗаписей.<Имя>.
//
Процедура ПередВыгрузкойДанных(ЭлементДанных) Экспорт
	
	// СтандартныеПодсистемы.ФайловыеФункции
	ОтправкаЭлемента = ОтправкаЭлементаДанных.Авто;
	ОбменФайламиСобытия.ПриОтправкеДанныхФайла(ЭлементДанных, ОтправкаЭлемента, Ложь);
	// Конец СтандартныеПодсистемы.ФайловыеФункции
	
КонецПроцедуры

// Обработчик, вызываемый для считанных из файла данных перед их записью в ИБ при загрузке областей.
//
// Параметры:
// ЭлементДанных - КонстантаМенеджер.<Имя>; СправочникОбъект.<Имя>; Регистр<Вид>НаборЗаписей.<Имя>.
//
Процедура ПередЗагрузкойДанных(ЭлементДанных) Экспорт
	
	// СтандартныеПодсистемы.ФайловыеФункции
	ПолучениеЭлемента = ПолучениеЭлементаДанных.Авто;
	ОбменФайламиСобытия.ПриПолученииДанныхФайла(ЭлементДанных, ПолучениеЭлемента);
	// Конец СтандартныеПодсистемы.ФайловыеФункции
	
КонецПроцедуры

// Обработчик, вызываемый перед завершением выгрузки данных области.
//
// Параметры:
//  КаталогВыгрузки - Строка - каталог с подготовленными файлами выгрузки.
//   При окончании выгрузки все файлы из этого каталога попадут в 
//   результирующий архив.
//
Процедура ПередЗавершениемВыгрузки(Знач КаталогВыгрузки) Экспорт
	
	Справочники.ИдентификаторыОбъектовМетаданных.ВыгрузитьДанныеСправочника(КаталогВыгрузки);
	
КонецПроцедуры

// Обработчик, вызываемый перед стандартным формированием словаря замен
//
// Параметры
//  СловарьЗамен - таблица значений, колонки:
//    Тип - Тип - Тип значения заменяемой ссылки
//    СоответствиеСсылок - Соответствие - соответствие новой ссылки исходной
//     Ключ - Новая ссылка (на которую требуется заменить)
//     Значение - Исходная ссылка (требующая замены)
//  КаталогВыгрузки - Строка - имя каталога с файлами выгрузки
//
Процедура ДополнитьСловарьЗаменПоКаталогуВыгрузки(Знач СловарьЗамен, Знач КаталогВыгрузки) Экспорт
	
	Справочники.ИдентификаторыОбъектовМетаданных.ДополнитьСловарьЗаменСсылокИдентификаторовТекущихИЗагружаемыхДанных(СловарьЗамен, КаталогВыгрузки);
	
КонецПроцедуры

// Обработчик, вызываемый при окончании стандартного формирования словаря замен
// по очередному файлу общих данных.
//
// Параметры
//  СловарьЗамен - таблица значений, колонки:
//    Тип - Тип - Тип значения заменяемой ссылки
//    СоответствиеСсылок - Соответствие - соответствие новой ссылки исходной
//     Ключ - Новая ссылка (на которую требуется заменить)
//     Значение - Исходная ссылка (требующая замены)
//  ИмяФайлаОбщихДанных - Строка - имя текущего обрабатываемого файла выгрузки
//   общих данных
//
Процедура ДополнитьСловарьЗаменПоОбщимДанным(Знач СловарьЗамен, Знач ИмяФайлаОбщихДанных) Экспорт
	
КонецПроцедуры
