
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗаполнитьСписокУзлов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокУзлов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбластиДанных.ОбластьДанных КАК ОбластьДанных
	|ИЗ
	|	РегистрСведений.ОбластиДанных КАК ОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ИзмененияПоставляемыхДанных КАК ИзмененияПоставляемыхДанных
	|		ПО ОбластиДанных.ОбластьДанных = ИзмененияПоставляемыхДанных.ОбластьДанных
	|ГДЕ
	|	ИзмененияПоставляемыхДанных.Ссылка ЕСТЬ NULL ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПоставляемыеДанные.СоздатьУзелОбластиДанных(Выборка.ОбластьДанных);
	КонецЦикла;
	
КонецПроцедуры