
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйЭлемент = Неопределено;
	Если Параметры.Свойство("ВыбранныйЭлемент") Тогда
		ВыбранныйЭлемент = Параметры.ВыбранныйЭлемент;
	КонецЕсли;	
	
	Если Параметры.СписокЗначенийДляВыбора <> Неопределено
		И Параметры.СписокЗначенийДляВыбора.Количество() > 0 Тогда
		
		ЭлементыДерева = Дерево.ПолучитьЭлементы();
		Для Каждого Элемент Из Параметры.СписокЗначенийДляВыбора Цикл
			НоваяСтрока = ЭлементыДерева.Добавить();	
			НоваяСтрока.Наименование = Элемент.Значение.Name;
			НоваяСтрока.ID = Элемент.Значение.ID;
			НоваяСтрока.Тип = Элемент.Значение.Type;
			НоваяСтрока.Картинка = 2;
		КонецЦикла;
		
		Элементы.ФормаНайти.Видимость = Ложь;
		Элементы.ФормаОтменитьПоиск.Видимость = Ложь;
		Элементы.ДеревоКонтекстноеМенюНайти.Видимость = Ложь;
		Элементы.ДеревоКонтекстноеМенюОтменитьПоиск.Видимость = Ложь;
		
	Иначе
		ТипОбъектаВыбора = Параметры.ТипОбъектаВыбора;
		Отбор = Параметры.Отбор;
		
		ЗаполнитьДеревоПапок(Дерево.ПолучитьЭлементы(), "", , ВыбранныйЭлемент); // корневые папки
		
		// найти эл по умолч
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда 
		ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;	
	
	ВыборГрупп = Параметры.ВыборГрупп;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПапок(ВеткаДерева, ИдентификаторПапки = Неопределено, СтрокаПоиска = Неопределено,
	ВыбранныйЭлемент = Неопределено)
	
	ВеткаДерева.Очистить();
	Прокси = РаботаС1СДокументооборотВызовСервера.ПолучитьПрокси();
	
	СписокУсловий = РаботаС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListQuery");
	Если ИдентификаторПапки <> Неопределено Тогда
		РодительИд = РаботаС1СДокументооборот.СоздатьObjectID(Прокси, ИдентификаторПапки, ТипОбъектаВыбора);
		
		Условие = РаботаС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
		Условие.property = "Parent";
		Условие.value = РодительИд;
		
		СписокУсловий.conditions.Добавить(Условие);
	КонецЕсли;
	
	Если СтрокаПоиска <> Неопределено Тогда
		Условие = РаботаС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
		Условие.property = "Name";
		Условие.value = СтрокаПоиска;
		
		СписокУсловий.conditions.Добавить(Условие);
	КонецЕсли;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Условие = РаботаС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
		Условие.property = "SelectedItem"; // имеет смысл только для иерархического справочника
		РодительИд = РаботаС1СДокументооборот.СоздатьObjectID(Прокси, ВыбранныйЭлемент, ТипОбъектаВыбора);
		Условие.value = РодительИд;
		
		СписокУсловий.conditions.Добавить(Условие);
	КонецЕсли;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда 
		Для Каждого СтрокаОтбора Из Отбор Цикл
			Условие = РаботаС1СДокументооборот.СоздатьОбъект(Прокси, "DMObjectListCondition");
			Условие.property = СтрокаОтбора.Ключ;
			
			Если ТипЗнч(СтрокаОтбора.Значение) = Тип("Структура") Тогда
				Условие.value =	РаботаС1СДокументооборот.СоздатьObjectID(Прокси, СтрокаОтбора.Значение.id, СтрокаОтбора.Значение.type);
			Иначе
				Условие.value = СтрокаОтбора.Значение;
			КонецЕсли;	
		
			СписокУсловий.conditions.Добавить(Условие);
		КонецЦикла;	
	КонецЕсли;	
	
	Запрос = РаботаС1СДокументооборот.СоздатьОбъект(Прокси, "DMGetObjectListRequest");
	Запрос.type = ТипОбъектаВыбора;
	Запрос.query = СписокУсловий;
	
	Результат = Прокси.execute(Запрос);
	РаботаС1СДокументооборотВызовСервера.ПроверитьВозвратВебСервиса(Прокси, Результат);
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		
		Для Каждого Элемент Из Результат.items Цикл
			НоваяСтрока = ВеткаДерева.Добавить();
			ЗаполнитьЭлементДерева(НоваяСтрока, Элемент, СтрокаПоиска);
		КонецЦикла;
		
	Иначе
		// заполним дерево - для каждого уровня нужные элементы вставим и восстановим текущую строку
		ЕстьДочерниеЭлементы = Ложь;
		ИдентификаторВеткиВыбранногоЭлемента = Неопределено;
		ЗаполнитьУровеньДерева(ВеткаДерева, "", Результат.items, СтрокаПоиска, ЕстьДочерниеЭлементы,
			ВыбранныйЭлемент, ИдентификаторВеткиВыбранногоЭлемента); // "" - корень
			
		Если ИдентификаторВеткиВыбранногоЭлемента <> Неопределено Тогда
			Элементы.Дерево.ТекущаяСтрока = ИдентификаторВеткиВыбранногоЭлемента;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУровеньДерева(ВеткаДерева, ИдентификаторРодителя, ЭлементыXDTO, СтрокаПоиска, ЕстьДочерниеЭлементы,
	ВыбранныйЭлемент, ИдентификаторВеткиВыбранногоЭлемента)
	
	ЕстьДочерниеЭлементы = Ложь;
	
	Для Каждого Элемент Из ЭлементыXDTO Цикл
		
		Если (Элемент.parentID <> Неопределено И Элемент.parentID.id = ИдентификаторРодителя)
			ИЛИ (Элемент.parentID = Неопределено И ИдентификаторРодителя = "") Тогда
		
			НоваяСтрока = ВеткаДерева.Добавить();
			ЗаполнитьЭлементДерева(НоваяСтрока, Элемент, СтрокаПоиска, Ложь);
			ЕстьДочерниеЭлементы = Истина;
			
			Если НоваяСтрока.ID = ВыбранныйЭлемент Тогда
				ИдентификаторВеткиВыбранногоЭлемента = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
			ЕстьДочерниеЭлементыУПодветки = Ложь;
			ЗаполнитьУровеньДерева(НоваяСтрока.ПолучитьЭлементы(), Элемент.object.objectId.id, ЭлементыXDTO, 
				СтрокаПоиска, ЕстьДочерниеЭлементыУПодветки, ВыбранныйЭлемент, ИдентификаторВеткиВыбранногоЭлемента);
				
			Если ЕстьДочерниеЭлементыУПодветки Тогда
				НоваяСтрока.ПодпапкиСчитаны = Истина;
			Иначе	
				Если Элемент.canHaveChildren И (СтрокаПоиска = Неопределено) Тогда
					НоваяСтрока.ПодпапкиСчитаны = Ложь;
					ФиктивныйЛист = НоваяСтрока.ПолучитьЭлементы().Добавить(); // чтобы появился плюсик
				Иначе
					НоваяСтрока.ПодпапкиСчитаны = Истина;
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЭлементДерева(НоваяСтрока, Элемент, СтрокаПоиска, СоздаватьФиктивныйЛист = Истина)
	
	НоваяСтрока.Наименование = Элемент.object.name;
	НоваяСтрока.ID = Элемент.object.objectId.id;
	НоваяСтрока.Тип = Элемент.object.objectId.type;
	НоваяСтрока.ЭтоГруппа = Элемент.isFolder;
	
	Если ТипОбъектаВыбора = "DMFileFolder" ИЛИ ТипОбъектаВыбора = "DMInternalDocumentFolder" Тогда
		НоваяСтрока.Картинка = 0;
	Иначе
		Если Элемент.isFolder Тогда
			НоваяСтрока.Картинка = 0;
		Иначе	
			НоваяСтрока.Картинка = 2;
		КонецЕсли;	
	КонецЕсли;
	
	Если СоздаватьФиктивныйЛист Тогда
		Если Элемент.canHaveChildren И (СтрокаПоиска = Неопределено) Тогда
			НоваяСтрока.ПодпапкиСчитаны = Ложь;
			ФиктивныйЛист = НоваяСтрока.ПолучитьЭлементы().Добавить(); // чтобы появился плюсик
		Иначе
			НоваяСтрока.ПодпапкиСчитаны = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ДеревоВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Дерево.НайтиПоИдентификатору(Значение);
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ТекущиеДанные.ЭтоГруппа И Не ВыборГрупп Тогда 
		Предупреждение(НСтр("ru = 'Выберите элемент, а не группу.'"));
		Возврат;
	КонецЕсли;
		
	Результат = Новый Структура;
	Результат.Вставить("РеквизитID",  ТекущиеДанные.ID);
	Результат.Вставить("РеквизитТип", ТекущиеДанные.Тип);
	Результат.Вставить("РеквизитПредставление", ТекущиеДанные.Наименование);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ТекущиеДанные.ЭтоГруппа И Не ВыборГрупп Тогда 
		Предупреждение(НСтр("ru = 'Выберите элемент, а не группу.'"));
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("РеквизитID",  ТекущиеДанные.ID);
	Результат.Вставить("РеквизитТип", ТекущиеДанные.Тип);
	Результат.Вставить("РеквизитПредставление", ТекущиеДанные.Наименование);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередРазворачиванием(Элемент, Строка, Отказ)
	
	Лист = Дерево.НайтиПоИдентификатору(Строка);
	
	Если Лист = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ Лист.ПодпапкиСчитаны Тогда
		ЗаполнитьДеревоПапокПоИдентификатору(Строка, Лист.ID);
		Лист.ПодпапкиСчитаны = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПапокПоИдентификатору(ИдентификаторЭлементаДерева, ИдентификаторПапки)
	
	Лист = Дерево.НайтиПоИдентификатору(ИдентификаторЭлементаДерева);
	
	Если Лист = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДеревоПапок(Лист.ПолучитьЭлементы(), Лист.ID);
	
КонецПроцедуры		

&НаКлиенте
Процедура НайтиВыполнить(Команда)
	
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ДокументооборотПоискВСписке");
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ЗаполнитьДеревоПапокОтКорня(, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоиск(Команда)
	
	// отменяем режим поиска
	ЗаполнитьДеревоПапокОтКорня(""); // корневые папки
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоПапокОтКорня(ИдентификаторПапки = Неопределено, СтрокаПоиска = Неопределено)
	
	ЗаполнитьДеревоПапок(Дерево.ПолучитьЭлементы(), ИдентификаторПапки, СтрокаПоиска);
	
КонецПроцедуры
