///////////////////////////////////////////////////////////////////////////////////
// ОбновлениеИнформационнойБазыВМоделиСервиса: Обновление текущей области данных.
//  
///////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Обновление областей данных.

// Выполняет обновление версии информационной базы в текущей области данных
// и снимает блокировку сеансов в области, в случае если она была установлена
// ранее.
//
Процедура ВыполнитьОбновлениеТекущейОбластиДанных() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы();
	
	ПараметрыБлокировки = СоединенияИБ.ПолучитьБлокировкуСеансовОбластиДанных();
	Если НЕ ПараметрыБлокировки.Установлена Тогда
		Возврат;
	КонецЕсли;
	ПараметрыБлокировки.Установлена = Ложь;
	СоединенияИБ.УстановитьБлокировкуСеансовОбластиДанных(ПараметрыБлокировки);
	
КонецПроцедуры

// Выбирает все области данных с неакутальными версиями
// и при необходимости формирует фоновые задания по обновлению
// версии в них.
//
// Параметры:
// БлокироватьОбласти - Булево - устанавливать блокировку сеансов областей данных
//  на время обновления областей
//
Процедура ЗапланироватьОбновлениеОбластейДанных(Знач БлокироватьОбласти = Истина, Знач СообщениеБлокировки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(СообщениеБлокировки) Тогда
		СообщениеБлокировки = Константы.СообщениеБлокировкиПриОбновленииКонфигурации.Получить();
		Если ПустаяСтрока(СообщениеБлокировки) Тогда
			СообщениеБлокировки = НСтр("ru = 'Система заблокирована для выполнения обновления.'");
		КонецЕсли;
	КонецЕсли;
	ПараметрыБлокировки = СоединенияИБ.НовыеПараметрыБлокировкиСоединений();
	ПараметрыБлокировки.Начало = ТекущаяУниверсальнаяДата();
	ПараметрыБлокировки.Сообщение = СообщениеБлокировки;
	ПараметрыБлокировки.Установлена = Истина;
	ПараметрыБлокировки.Эксклюзивная = Истина;
	
	ВерсияМетаданных = Метаданные.Версия;
	Если ПустаяСтрока(ВерсияМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ВерсияОбщихДанных = ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя, Истина);
	Если ОбновлениеИнформационнойБазы.НеобходимоВыполнитьОбновление(ВерсияМетаданных, ВерсияОбщихДанных) Тогда
		// Не выполнено обновление общих данных смысла планировать
		// обновление областей нет
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбластиДанных.ОбластьДанных КАК ОбластьДанных
	|ИЗ
	|	РегистрСведений.ОбластиДанных КАК ОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем
	|		ПО ОбластиДанных.ОбластьДанных = ВерсииПодсистем.ОбластьДанных
	|			И (ВерсииПодсистем.ИмяПодсистемы = &ИмяПодсистемы)
	|ГДЕ
	|	ОбластиДанных.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбластейДанных.Используется))
	|	И (ВерсииПодсистем.ОбластьДанных ЕСТЬ NULL 
	|			ИЛИ ВерсииПодсистем.Версия <> &Версия)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбластьДанных";
	Запрос.УстановитьПараметр("ИмяПодсистемы", Метаданные.Имя);
	Запрос.УстановитьПараметр("Версия", ВерсияМетаданных);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1
	|ИЗ
	|	РегистрСведений.ОбластиДанных КАК ОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем
	|		ПО ОбластиДанных.ОбластьДанных = ВерсииПодсистем.ОбластьДанных
	|			И (ВерсииПодсистем.ИмяПодсистемы = &ИмяПодсистемы)
	|ГДЕ
	|	ОбластиДанных.ОбластьДанных = &ОбластьДанных
	|	И ОбластиДанных.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбластейДанных.Используется))
	|	И (ВерсииПодсистем.ОбластьДанных ЕСТЬ NULL 
	|			ИЛИ ВерсииПодсистем.Версия <> &Версия)";
	Запрос.УстановитьПараметр("ИмяПодсистемы", Метаданные.Имя);
	Запрос.УстановитьПараметр("Версия", ВерсияМетаданных);
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначенияКлюча = Новый Структура;
		ЗначенияКлюча.Вставить("ОбластьДанных", Выборка.ОбластьДанных);
		ЗначенияКлюча.Вставить("ИмяПодсистемы", "");
		КлючЗаписи = РегистрыСведений.ВерсииПодсистем.СоздатьКлючЗаписи(ЗначенияКлюча);
		Попытка
			ЗаблокироватьДанныеДляРедактирования(КлючЗаписи);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Запрос.УстановитьПараметр("ОбластьДанных", Выборка.ОбластьДанных);
		НачатьТранзакцию();
		Попытка
			Результат = Запрос.Выполнить();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Планирование обновления области данных'"), 
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		Если Результат.Пустой() Тогда
			РазблокироватьДанныеДляРедактирования(КлючЗаписи);
			Продолжить;
		КонецЕсли;
		
		ОтборЗадания = Новый Структура;
		ОтборЗадания.Вставить("ИмяМетода", "ОбновлениеИнформационнойБазыВМоделиСервиса.ВыполнитьОбновлениеТекущейОбластиДанных");
		ОтборЗадания.Вставить("Ключ"     , "1");
		ЗапланированноеЗадание = ОчередьЗаданий.ПолучитьЗадание(ОтборЗадания, Выборка.ОбластьДанных);
		Если ЗапланированноеЗадание <> Неопределено Тогда
			РазблокироватьДанныеДляРедактирования(КлючЗаписи);
			Продолжить;
		КонецЕсли;
		
		РазблокироватьДанныеДляРедактирования(КлючЗаписи);
		
		ОчередьЗаданий.ЗапланироватьВыполнениеЗадания(
			"ОбновлениеИнформационнойБазыВМоделиСервиса.ВыполнитьОбновлениеТекущейОбластиДанных",, "1", Истина, Выборка.ОбластьДанных);
		
		Если БлокироватьОбласти Тогда
			ОбщегоНазначения.УстановитьРазделениеСеанса(Истина, Выборка.ОбластьДанных);
			СоединенияИБ.УстановитьБлокировкуСеансовОбластиДанных(ПараметрыБлокировки, Ложь);
			ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик регламентного задания ОбновлениеОбластейДанных
// Выбирает все области данных с неакутальными версиями
// и при необходимости формирует фоновые задания ОбновлениеИб
// в них.
//
Процедура ОбновлениеОбластейДанных() Экспорт
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ЗапланироватьОбновлениеОбластейДанных(Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Заменяет статусы областей данных УдалитьГотова на Используется в регистре ОбластиДанных
//
Процедура ЗаменитьСтатусОбластейГотова() Экспорт
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.ОбластиДанных");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбластиДанных.ОбластьДанных КАК ОбластьДанных
		|ИЗ
		|	РегистрСведений.ОбластиДанных КАК ОбластиДанных
		|ГДЕ
		|	ОбластиДанных.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбластейДанных.УдалитьГотова)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ОбластиДанных.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ОбластьДанных = Выборка.ОбластьДанных;
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Статус = Перечисления.СтатусыОбластейДанных.Используется;
			МенеджерЗаписи.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "*";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыВМоделиСервиса.ЗапланироватьОбновлениеОбластейДанных";
		Обработчик.ОбщиеДанные = Истина;
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "2.0.1.6";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыВМоделиСервиса.ЗаменитьСтатусОбластейГотова";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
КонецПроцедуры
