///////////////////////////////////////////////////////////////////////////////////
// ПоставляемыеДанныеПереопределяемый: Механизм сервиса поставляемых данных.
//
///////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура формирует таблицу соответствия разделенных типов данных общим данным
// Рекомендуется использовать процедуру через одноименную функцию в модуле ПоставляемыеДанные
//
// Параметры:
// ТаблицаСоответствия - ТаблицаЗначений - таблица, которую необходимо заполнить соответствиями типов
//
Процедура ПолучитьТаблицуСоответствияРазделенныхДанныхОбщим(ТаблицаСоответствия) Экспорт
	
КонецПроцедуры

// Процедура переопределяет действия при подборе поставляемых данных в область данных
//
// Параметры:
// СсылкаОбщихДанных - Ссылка - ссылка на элемент подбираемый в область данных
//
Процедура ПриПодбореПоставляемыхДанныхВОбласть(СсылкаОбщихДанных) Экспорт

КонецПроцедуры

// Процедура переопределяет действия при записи нового элемента поставляемых данных
//
// Параметры:
// СсылкаОбщихДанных - Ссылка - ссылка на элемент подбираемый в область данных
//
Процедура ПриРегистрацииНовогоОбъектаПоставляемыхДанных(ЭлементОбщихДанных) Экспорт

КонецПроцедуры

// Вызывается при необходимости обновления разделенного набора записей из неразделенного.
//
// Параметры:
// Эталон - РегистрСведенийНаборЗаписей - неразделенный набор записей по которому необходимо
//        обновить разделенный.
// ОбъектМД - ОбъектМетаданных - метаданные неразделенного регистра сведений
// Менеджер - РегистрСведенийМенеджер - менджер разделенного регистра сведений
// ТипИсточника - Тип - тип ключа записи неразделенного регистра
// ТипПриемник - Тип - тип ключа записи разделенного регистра
// ОбъектПриемник - РегистрСведенийНаборЗаписей - в случае если в процедуре выполнено
//        переопределение стандартного поведения обновления, необходимо присвоить незаписанный
//        набор записей этому параметру.
// СтандартнаяОбработка - Булево - в случае если в процедуре выполнено
//        переопределение стандартного поведения обновления, необходимо присвоить этому 
//        параметру значение Ложь.
//
Процедура ПередКопированиемНабораЗаписейИзЭталона(Эталон, ОбъектМД, Менеджер, ТипИсточника, 
		ТипПриемника, ОбъектПриемник, СтандартаяОбработка) Экспорт
		
КонецПроцедуры
	
// Вызывается при необходимости обновления разделенного элемента из неразделенного.
//
// Параметры:
// Эталон - СправочникОбъект - неразделенный объект по которому необходимо
//        обновить разделенный.
// ОбъектМД - ОбъектМетаданных - метаданные неразделенного справочника
// Менеджер - СправочникМенеджер - менджер разделенного регистра сведений
// ТипИсточника - Тип - тип ссылки неразделенного справочника
// ТипПриемник - Тип - тип ссылки разделенного справочника
// ОбъектПриемник - СправочникОбъект - в случае если в процедуре выполнено
//        переопределение стандартного поведения обновления, необходимо присвоить незаписанный
//        объект этому параметру.
// СтандартнаяОбработка - Булево - в случае если в процедуре выполнено
//        переопределение стандартного поведения обновления, необходимо присвоить этому 
//        параметру значение Ложь.
//
Процедура ПередКопированиемОбъектаИзЭталона(Эталон, ОбъектМД, Менеджер, ТипИсточника, 
		ТипПриемника, ОбъектПриемник, СтандартаяОбработка) Экспорт
		
КонецПроцедуры
