////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = НЕ УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей();
	ВыполнитьПроверкуПравДоступа("АдминистрированиеДанных", Метаданные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ВыполнитьОбновление", 0.1, Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыполнитьОбновление()
	
	Пока ОбновлениеТребуется() Цикл
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбновлениеТребуется()
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоличествоДанных = 0;
	УправлениеДоступом.ЗаполнениеДанныхДляОграниченияДоступа(КоличествоДанных);
	Если КоличествоДанных > 0 Тогда
		ВыполненоШаговОбновления = 1;
	КонецЕсли;
	Начало = ТекущаяДатаСеанса();
	
	Пока РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ЗаполнениеДанныхДляОграниченияДоступа).Использование
	   И Начало + 15 > ТекущаяДатаСеанса() Цикл
		
		ВыполненоШаговОбновления = ВыполненоШаговОбновления + 1;
		УправлениеДоступом.ЗаполнениеДанныхДляОграниченияДоступа();
		
	КонецЦикла;
	
	ОбновлениеТребуется = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ЗаполнениеДанныхДляОграниченияДоступа).Использование;
	Элементы.ВыполнениеЗавершено.Видимость = НЕ ОбновлениеТребуется;
	
	Возврат ОбновлениеТребуется;
	
КонецФункции

