////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаПользовательскийСайт = НСтр("ru = 'Перейти к регистрации на пользовательском сайте'");
	
	АдресныйКлассификатор.ПолучитьПараметрыАутентификации(КодПользователя, Пароль);
	
	СохранятьПароль = ? (ПустаяСтрока(Пароль), Ложь, Истина);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Реализует переход к пользовательскому сайту 1С
//
&НаКлиенте
Процедура СсылкаНаПользовательскийСайтНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение("http://users.v8.1c.ru/");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия на кнопку "Продолжить"
//
// Параметр закрытия формы: Неопределено - пользователь отказался от ввода пароля
//							Структура  - 
//							            ключ "Статус", булево - истина или ложь в зависмости от успеха вызова
//							            ключ "КодПользователя", строка - в случае если статус Истина содержит
//							                                    код пользователя
//							            ключ "Пароль", строка - в случае если статус Истина содержит пароль
&НаКлиенте
Процедура СохранитьДанныеАутентификацииИПродолжитьВыполнить()
	
	Если СохранятьПароль Тогда
		АдресныйКлассификатор.СохранитьПараметрыАутентификации(КодПользователя, Пароль);
	Иначе
		АдресныйКлассификатор.СохранитьПараметрыАутентификации(КодПользователя, Неопределено);
	КонецЕсли;
	
	Закрыть(Новый Структура("Статус, КодПользователя ,Пароль", Истина, КодПользователя, Пароль));
	
КонецПроцедуры


