////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

&НаКлиенте
Процедура КнопкаОКВыполнить()
	
	СписокТипов = Новый СписокЗначений;
	Если ФорматMXL Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.MXL, "mxl");
	КонецЕсли;
	
	Если ФорматHTML Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.HTML, "html");
	КонецЕсли;
	
	Если ФорматXLS Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.XLS, "xls");
	КонецЕсли;
	
	Если ФорматPDF Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.PDF, "pdf");
	КонецЕсли;
	
	Если ФорматODS Тогда
		СписокТипов.Добавить(ТипФайлаТабличногоДокумента.ODS, "ods");
	КонецЕсли;

	
	Если СписокТипов.Количество() = 0 Тогда
		Предупреждение(НСтр("ru = 'Необходимо указать как минимум один из предложенных форматов.'"));
		Возврат;
	КонецЕсли;	
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапаковатьZIP", ЗапаковатьZIP);
	Результат.Вставить("СписокТипов", СписокТипов);
	
	Закрыть(Результат);
	
КонецПроцедуры
