// Открывать файл для просмотра
Процедура ОткрытьФайл(АдресВременногоХранилища, Расширение, Имя, Размер) Экспорт
	
	#Если ВебКлиент Тогда
		ИмяФайла = ПолучитьИмяСРасширением(Имя, Расширение);
		ПолучитьФайл(АдресВременногоХранилища, ИмяФайла, Истина);
	#Иначе
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		
		ПередаваемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(ИмяВременногоФайла, АдресВременногоХранилища);
		ПередаваемыеФайлы.Добавить(Описание);
		
		Файл = Новый Файл(ИмяВременногоФайла);
		ПутьКФайлу = Файл.Путь;
		ПутьКФайлу = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКФайлу, ОбщегоНазначенияКлиентПовтИсп.ТипПлатформыКлиента());
		
		ИмяФайла = ПолучитьИмяСРасширением(Имя, Расширение);
		РазмерВМб = Размер / (1024 * 1024);
		
		ТекстПояснения =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		    НСтр("ru = 'Выполняется передача файла ""%1"" (%2 Мб)...
				|Пожалуйста, подождите.'"),
		    ИмяФайла, 
			ФайловыеФункцииКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМб));
		
		Состояние(ТекстПояснения);
		
		// Сохраним Файл из БД на диск
		Если ПолучитьФайлы(ПередаваемыеФайлы,, ПутьКФайлу, Ложь) Тогда
			
			Состояние();
			ОткрытьФайлПриложением(ИмяВременногоФайла);
			
		Иначе
			Состояние();
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры

Процедура ОткрытьФайлПриложением(ИмяОткрываемогоФайла)
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	
	Если РасширениеПодключено Тогда
		// Открыть Файл
		Попытка
			
			ЗапуститьПриложение(ИмяОткрываемогоФайла);
			
		Исключение
			
			Инфо = ИнформацияОбОшибке();
			Предупреждение(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								  НСтр("ru = 'Описание=""%1""'"),
								  Инфо.Описание));
			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает имя с расширением- если расширение пусто - только имя
//
Функция ПолучитьИмяСРасширением(ПолноеНаименование, Расширение) Экспорт
	
	ИмяСРасширением = ПолноеНаименование;
	
	Если Расширение <> "" Тогда
		ИмяСРасширением = ИмяСРасширением + "." + Расширение;
	КонецЕсли;
	
	Возврат ИмяСРасширением;
	
КонецФункции
