// Формирует массив ссылок на файлы
// Параметры
// Объект - объект информационной базы
// МассивФайлов - Массив ссылок на справочник Файлы
Процедура ПолучитьСписокФайлов(Объект, МассивФайлов) Экспорт
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиВызовСервера.ПолучитьПрикрепленныеФайлыКОбъекту(Объект, МассивФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПрисоединенныеФайлы
	ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(Объект, МассивФайлов);
	// Конец СтандартныеПодсистемы.ПрисоединенныеФайлы
		
КонецПроцедуры

// Формирует представление переданного объекта
// Параметры
// ПредметЗадачи - объект, представление которого надо сформировать
// Представление - Строка с HTML текстом или MXL документ
Процедура ПолучитьПредставлениеПредметаВнешнейЗадачи(ПредметЗадачи, Представление) Экспорт
	
	
	
КонецПроцедуры

// Создает и стартует внешний бизнес-процесс по указанной задаче
// Параметры
// Задача - ЗадачаСсылка.ЗадачаИсполнителя
Функция СтартоватьВнешнийБизнесПроцесс(Задача) Экспорт
	
	// Следует переопределить эту функцию, если в качестве внешнего 
	// нужно использовать не бизнес-процесс "Задание", а другой.
	
	Возврат Ложь;
	
КонецФункции	

// Помечает задачу-источник указанного бизнес-процесса как выполненную
// Параметры
// БизнесПроцесс - тип БизнесПроцессСсылка
// Возвращаемое значение:
//   Булево	 - Если задача выполнена успешно, возвращает Истина, иначе Ложь
Функция ВыполнитьЗадачуИсточник(БизнесПроцесс) Экспорт
	
	Возврат Ложь;
	
КонецФункции	

// Проверяет является ли задача внешней
// Если проверка выполнена, то возвращает Истина или Ложь
// Иначе возвращает Неопределено
// Параметры
// Задача - ЗадачаСсылка.ЗадачаИсполнителя
// 
// Возвращаемое значение:
//   Булево	 - Если проверка выполнена, то возвращает Истина или Ложь, Иначе возвращает Неопределено
Функция ЭтоВнешняяЗадача(ЗадачаСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции	


