////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Получает список отчетов, доступных текущему пользователю
// 
// Возвращаемое значение: 
//   СписокОтчетов (СписокЗначений) Список отчетов
//       |- Значение (Строка) Имя отчета, как оно задано в метаданных
//
Функция ОтчетыТекущегоПользователя() Экспорт
	СписокОтчетов = Новый СписокЗначений;
	
	Для Каждого ОтчетМД Из Метаданные.Отчеты Цикл
		Если ПравоДоступа("Просмотр", ОтчетМД) Тогда
			СписокОтчетов.Добавить("Отчет."+ ОтчетМД.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокОтчетов;
КонецФункции

