
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Код = Параметры.Код;
	Размер = Параметры.Размер;
	Файл = Параметры.Файл;
	Описание = Параметры.Описание;
	Расширение = Параметры.Расширение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ОткрытьВыбранныйФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыбранныйФайл()
	
	АдресВременногоХранилища = ПолучитьАдресФайла(Код);
	
	РаботаСБиблиотекойФайловКлиент.ОткрытьФайл(АдресВременногоХранилища, Расширение, 
		Файл, Размер);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресФайла(Код)
	
	Прокси = РаботаСБиблиотекойФайлов.ПолучитьПрокси();
	ДанныеФайла = Прокси.GetFile(Код);
	
 	Адрес = ПоместитьВоВременноеХранилище(ДанныеФайла.BinaryData);
	
	Возврат Адрес;
	
КонецФункции
