
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дерево = РеквизитФормыВЗначение("ДеревоМетаданных");
	
	ТипПараметраКоманды = Метаданные.ОбщиеКоманды.ДокументооборотДокументы.ТипПараметраКоманды;
	
	ИменаМетаданных = Новый Массив;
	Для Каждого Тип Из ТипПараметраКоманды.Типы() Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		ИменаМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;	
	
	Если Метаданные.Справочники.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Справочники";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.Справочник;
		Для Каждого Объект Из Метаданные.Справочники Цикл
			Если ИменаМетаданных.Найти(Объект.ПолноеИмя()) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;	
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			НоваяСтрока.Синоним = ?(Объект.Синоним = "", Объект.Имя, Объект.Синоним);
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Документы.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Документы";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.Документ;
		Для Каждого Объект Из Метаданные.Документы Цикл
			Если ИменаМетаданных.Найти(Объект.ПолноеИмя()) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			НоваяСтрока.Синоним = ?(Объект.Синоним = "", Объект.Имя, Объект.Синоним);
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.БизнесПроцессы.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Бизнес-процессы";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.БизнесПроцесс;
		Для Каждого Объект Из Метаданные.БизнесПроцессы Цикл
			Если ИменаМетаданных.Найти(Объект.ПолноеИмя()) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			НоваяСтрока.Синоним = ?(Объект.Синоним = "", Объект.Имя, Объект.Синоним);
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Задачи.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Задачи";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.Задача;
		Для Каждого Объект Из Метаданные.Задачи Цикл
			Если ИменаМетаданных.Найти(Объект.ПолноеИмя()) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			НоваяСтрока.Синоним = ?(Объект.Синоним = "", Объект.Имя, Объект.Синоним);
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоМетаданных");
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда 
		Для Каждого СтрокаГруппа Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
			Для Каждого Строка Из СтрокаГруппа.ПолучитьЭлементы() Цикл
				Если Строка.Имя = Параметры.ТекущаяСтрока Тогда 
					Элементы.ДеревоМетаданных.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Строки = ДеревоМетаданных.ПолучитьЭлементы();
	Для Каждого Строка Из Строки Цикл 
		Элементы.ДеревоМетаданных.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	Если ТекущиеДанные.Имя = "" Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Имя",  	  ТекущиеДанные.Имя);
	Результат.Вставить("Синоним", ТекущиеДанные.Синоним);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоМетаданных.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	Если ТекущиеДанные.Имя = "" Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Имя",  	  ТекущиеДанные.Имя);
	Результат.Вставить("Синоним", ТекущиеДанные.Синоним);
	
	Закрыть(Результат);
	
КонецПроцедуры
