Перем Запрос;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтандартныеПодсистемыПереопределяемый.ДанныеПроизводственногоКалендаряПередЗаписьюНабораЗаписей(Отказ, Замещение, ЭтотОбъект, Запрос);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтандартныеПодсистемыПереопределяемый.ДанныеПроизводственногоКалендаряПриЗаписиНабораЗаписей(Отказ, Замещение, ЭтотОбъект, Запрос);
	
КонецПроцедуры
