////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается перед нажатием на команду открытия варианта отчета. 
// 
// Параметры:
//   Ключ                 (Строка) Имя отчета + "\" + Имя варианта отчета
//   ПараметрыФормы    (Структура) Параметры формы отчета
//   СтандартнаяОбработка (Булево) Флаг открытия формы отчета средствами подсистемы
// 
Процедура ПередОткрытиемФормыОтчета(Ключ, ПараметрыФормы, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается, когда требуется выполнить внешнюю команду для интеграции с другими подсистемами.
// 
// Параметры:
//   УникальныйИдентификатор (Строка) Ключ варианта отчета
//   ПараметрКоманды (*) Параметры внешней команды
// 
Процедура ВыполнитьВнешнююКоманду(УникальныйИдентификатор, ПараметрКоманды) Экспорт
	
КонецПроцедуры
