
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбновитьПоставляемыеДанные();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьПоставляемыеДанные()
	
	ПоставляемыеДанные.ОбновитьПоставляемыеДанные(ОбщегоНазначения.ЗначениеРазделителяСеанса(), 0);
	
КонецПроцедуры
